snlkuharlocal/src/Catalogs/НазначенияШК/НазначенияШК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НазначенияШК</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВложениеДокументовВКороб</name>
      <description>Вложение документов в кор</description>
    </items>
    <items>
      <name>ВозобновлениеДО</name>
      <description>Возобновление ДО</description>
    </items>
    <items>
      <name>ВозобновлениеНабора</name>
      <description>Возобновление набора</description>
    </items>
    <items>
      <name>ВозобновлениеСканирования</name>
      <description>Возобновление сканировани</description>
    </items>
    <items>
      <name>Документ</name>
      <description>Документ</description>
    </items>
    <items>
      <name>НачалоКоллективнойРаботы</name>
      <description>Начало колл. работы</description>
    </items>
    <items>
      <name>НачалоКомплектации</name>
      <description>Начало комплектации</description>
    </items>
    <items>
      <name>НачалоМаркировки</name>
      <description>Начало маркировки</description>
    </items>
    <items>
      <name>НачалоНабора</name>
      <description>Начало набора</description>
    </items>
    <items>
      <name>НачалоПереукладки</name>
      <description>Начало переукладки</description>
    </items>
    <items>
      <name>НачалоСканирования</name>
      <description>Начало сканирования</description>
    </items>
    <items>
      <name>НачалоТермоусадки</name>
      <description>Начало термоусадки</description>
    </items>
    <items>
      <name>ОкончаниеДопОбработки</name>
      <description>Окончание доп. обработки</description>
    </items>
    <items>
      <name>ОкончаниеКоллективнойРаботы</name>
      <description>Окончание колл. работы</description>
    </items>
    <items>
      <name>ОкончаниеНабора</name>
      <description>Окончание набора</description>
    </items>
    <items>
      <name>ОкончаниеПереукладки</name>
      <description>Окончание переукладки</description>
    </items>
    <items>
      <name>ОкончаниеСканирования</name>
      <description>Окончание сканирования</description>
    </items>
    <items>
      <name>ОкончаниеСпайки</name>
      <description>Окончание спайки</description>
    </items>
    <items>
      <name>ОкончаниеТермоусадки</name>
      <description>Окончание термоусадки</description>
    </items>
    <items>
      <name>ОстановкаДопОбработки</name>
      <description>Остановка доп обработки</description>
    </items>
    <items>
      <name>ОстановкаНабора</name>
      <description>Остановка набора</description>
    </items>
    <items>
      <name>ОстановкаСканирования</name>
      <description>Остановка сканирования</description>
    </items>
    <items>
      <name>Ошибка</name>
      <description>Ошибка</description>
    </items>
    <items>
      <name>ПечатьКодаКомплекта</name>
      <description>Печать кода комплекта</description>
    </items>
    <items>
      <name>ПечатьСпецификации</name>
      <description>Печать спецификации</description>
    </items>
    <items>
      <name>ПолученОригинал</name>
      <description>Получен оригинал</description>
    </items>
    <items>
      <name>ПропуститьСканирование</name>
      <description>Пропустить сканирование</description>
    </items>
    <items>
      <name>РежимБезСканирования</name>
      <description>Режим без сканирования</description>
    </items>
    <items>
      <name>Сброс</name>
      <description>Сброс</description>
    </items>
    <items>
      <name>Сектор_FLD</name>
      <description>Сектор FLD</description>
    </items>
    <items>
      <name>Сектор_Minimi</name>
      <description>Сектор Minimi</description>
    </items>
    <items>
      <name>Сектор_OMS</name>
      <description>Сектор OMS</description>
    </items>
    <items>
      <name>Сектор_SISI</name>
      <description>Сектор SISI</description>
    </items>
    <items>
      <name>Сектор_Белье</name>
      <description>Сектор белье</description>
    </items>
    <items>
      <name>Сектор_Носки</name>
      <description>Сектор носки</description>
    </items>
    <items>
      <name>Сектор_Реклама</name>
      <description>Сектор реклама</description>
    </items>
    <items>
      <name>ТипКороба</name>
      <description>Тип короба</description>
    </items>
    <items>
      <name>Товар</name>
      <description>Товар</description>
    </items>
    <items>
      <name>ФизЛицо</name>
      <description>Физ. лицо</description>
    </items>
    <items>
      <name>Этикетка</name>
      <description>Этикетка</description>
    </items>
  </predefined>
  <attributes>
    <name>ШтрихКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/НазначенияШК/ManagerModule.bsl
Функция ПолучитьНазначениеПоШК(Знач ШтрихКод) Экспорт
	Результат = Справочники.НазначенияШК.ПустаяСсылка();
			
	ШтрихКод = СокрЛП(ШтрихКод);
	Если СтрНачинаетсяС(ШтрихКод, "777") Тогда
		Результат = Справочники.НазначенияШК.ФизЛицо; 
	//Валетов + 15,04,2026 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-9465
	//Сократим коды коробов до 4 цифр
	//ИначеЕсли СтрНачинаетсяС(ШтрихКод, "999000") Тогда 
	ИначеЕсли СтрНачинаетсяС(ШтрихКод, "9990") Тогда
		Результат = Справочники.НазначенияШК.ТипКороба;		
	Иначе           
		Результат = Справочники.НазначенияШК.НайтиПоРеквизиту("ШтрихКод", ШтрихКод);
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //ПолучитьНазначениеПоШК(Знач ШтрихКод) Экспорт
